<!-- dflook/terraform-github-actions {"workspace":"json-outpputs-2","backend_type":"remote","backend":"c29358fd663321e48db5a2af0ba2f074ae2c114d45d36e0e7ac2c87a4978c560","plan_job_ref":"Job Test Terraform cloud #351 at https://github.com/dflook/terraform-github-actions/actions/runs/16658287136","plan_hash":"8552a188724038d7918c7a247a8b49e7678db6898368a377fbc1e2b3b62089b7","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __json-outpputs-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #351](https://github.com/dflook/terraform-github-actions/actions/runs/16658287136)